app/views/movies/show.html.erb

	<strong>Comments:</strong>
	<%= pluralize(@movie.reviews.count, "comment") %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 9]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 13]]