app/controllers/movies_controller.rb

  def index
      @movies = Movie.all
---
SELECT  "movies".* FROM "movies" LIMIT 1

  def show
    #@reviews = Review.where(movie_id: @movie.id).order("updated_at DESC")
    @reviews = @movie.reviews.order("updated_at DESC")
    if @reviews.nil?
      @average_rating = 0
    else
      @average_rating = @reviews.average(:rating)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 9]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" IS NULL

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "duration", "director", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["description", ""], ["duration", ""], ["director", ""], ["created_at", "2015-05-23 05:44:35.110108"], ["updated_at", "2015-05-23 05:44:35.110108"]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "movies"."id" = $6