app/controllers/reviews_controller.rb

  def create
    @review = current_user.reviews.build(review_params)
    @review.movie_id = @movie.id

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 3], ["comment", "eerer"], ["user_id", 1], ["movie_id", 9], ["created_at", "2015-05-23 09:23:26.524755"], ["updated_at", "2015-05-23 09:23:26.524755"]]

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "The Grey comment 3 edit"], ["updated_at", "2015-05-25 06:11:21.398675"], ["id", 13]]